let categories = [
    {
        "_id": "5fc2b3e37add484f885c655c",
        "status": 1,
        "title": "دام",
        "sort": 0.0,
        "children": "گاو – گوسفند – بز – گاومیش – شتر – اسب – الاغ"
    },
    {
        "_id": "5fc2b3e37add484f885c655d",
        "status": 1,
        "title": "طیور",
        "sort": 1.0,
        "children": "مرغ – بوقلمون–  اردک – غاز – بلدرچین – شترمرغ – کبوتر – قرقاول– بلدرچین – کبک"
    },
    {
        "_id": "5fc2b3e37add484f885c655f",
        "status": 1,
        "title": "علوفه",
        "sort": 3.0,
        "children": "یونجه – شبدر – کاه و کلش – پرس –  سورگوم علوفه ای – سیلوی ذرت – سیلوی یونجه – علوفه بادام زمینی – ذرت علوفه ای – علوفه های باغی – تفاله چغندر – ضایعات کارخانه پنبه پاک کنی – ضایعات مزرعه ذرت – علوفه سویا – کنجاله کنجد – کنجاله سویا – کنجاله پنبه –  کنجاله کلزا – کنجاله آفتابگردان"
    },
    {
        "_id": "605c804bf81d424dcd7854ad",
        "status": 1,
        "title": "محصولات زراعی",
        "sort": 4.0,
        "children": "گندم – جو – برنج – ذرت – سورگوم – سویا– ارزن – سبوس جو – سبوس گندم – سبوس برنج – جو دوسر – چاودار– کلزا – پنبه – سیر – گوجه فرنگی – بادام زمینی – خربزه – هندوانه  – خیار – فلفل دلمه ای – سبزی – کدو سبز – بادمجان – عدس – نخود – لوبیا – لوبیا سبز – قارچ – سیب زمینی – پیاز – زعفران – تخمه آفتابگردان – تخم کتان – تخم کنجد – زرشک – چغندر – ماش – چای – هویج – فلفل تند – شلغم – طالبی – کدو حلوایی"
    },
    {
        "_id": "605c804bf81d424dcd7854ae",
        "status": 1,
        "title": "محصولات باغی",
        "sort": 5.0,
        "children": "هلو – شلیل – آلو – آلوچه – انار – سیب – گیلاس – زیتون – خرمالو – فندق – گردو – به – انگور – کشمش – توت – شاه توت – انجیر – قیسی – کیوی – گلابی – آلوچه – لیموشیرین – لیمو ترش – سنجد – پرتقال – توت فرنگی – نارنگی – تمشک – انبه – خرما – پسته – بادام درختی"
    },
    {
        "_id": "605c8250f81d424dcd7854af",
        "status": 1,
        "title": "سایر",
        "sort": 6.0,
        "children": "ادوات کشاورزی – حیوانات خانگی– زنبور عسل – ماهی – کرم ابریشم – اجاره زمین کشاورزی– بذر– کود حیوانی – کود شیمیایی"
    }
];
let arrays = [];

categories.map(c => {
    let children = c.children.split("–");
    let lastKey = null;
    children.map((ch, key) => {
        key = key + 1;
        lastKey = key + 1;
        key = key / 100;
        arrays.push({title: ch.trim(), parent: c._id, sort: c.sort + key});
    });
    arrays.push({title: "سایر", parent: c._id, sort: c.sort + (lastKey / 100)});
});

let b = arrays;
